html/rust/pattern_match.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>枚举和模式</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="struct.html"> UP </a>
 |
 <a accesskey="H" href="rust.html"> HOME </a>
</div><div id="content">
<h1 class="title">枚举和模式</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgad36e94">枚举</a>
<ul>
<li><a href="#orgdc1574b">枚举值</a></li>
<li><a href="#orgccffc0a">Option 枚举</a></li>
</ul>
</li>
<li><a href="#org270d641">match 表达式</a></li>
</ul>
</div>
</div>
<p>
本章介绍 <b>枚举</b> ，也被称作 <span class="underline">enums</span> 。枚举允许通过列举 <span class="underline">可能的成员</span> 来定义一个类型：
</p>
<ol class="org-ol">
<li>定义并使用一个枚举来展示它是如何连同数据一起编码信息的</li>
<li>探索一个特别有用的枚举 Option: 它代表一个值要么是某个值要么什么都不是</li>
<li>在 match 表达式中用模式匹配，针对不同的枚举值编写相应要执行的代码</li>
<li>介绍 if let，另一个简洁方便处理代码中枚举的结构</li>
</ol>

<pre class="example">
枚举是一个很多语言都有的功能，不过不同语言中其功能各不相同

Rust 的枚举与 F#、OCaml 和 Haskell 这样的函数式编程语言中的”代数数据类型“最为相似
</pre>
<div id="outline-container-orgad36e94" class="outline-2">
<h2 id="orgad36e94">枚举</h2>
<div class="outline-text-2" id="text-orgad36e94">
<pre class="example">
首先看一个需要诉诸于代码的场景，来考虑为何此时使用枚举更为合适且实用

假设我们要处理 IP 地址。目前被广泛使用的两个主要 IP 标准：IPv4 和 IPv6
这是我们的程序可能会遇到的所有可能的 IP 地址类型：所以可以 枚举 出所有可能的值，这也正是此枚举名字的由来

任何一个 IP 地址要么是 IPv4 的要么是 IPv6 的，而且不能两者都是

IP 地址的这个特性使得枚举数据结构非常适合这个场景，因为枚举值只可能是其中一个成员
IPv4 和 IPv6 从根本上讲仍是 IP 地址，所以当代码在处理适用于任何类型的 IP 地址的场景时应该把它们当作相同的类型
</pre>

<p>
通过在代码中定义一个 <span class="underline">IpAddrKind</span> <b>枚举</b> 来表现这个概念并列出可能的 IP 地址类型， <span class="underline">V4</span> 和 <span class="underline">V6</span> 。这被称为枚举的 <b>成员</b> ：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">IpAddrKind</span> {
    <span style="color: #98f5ff;">V4</span>,
    <span style="color: #98f5ff;">V6</span>,
}
</pre>
</div>

<p>
现在 IpAddrKind 就是一个可以在代码中使用的 <b>自定义数据类型</b> 了
</p>
</div>
<div id="outline-container-orgdc1574b" class="outline-3">
<h3 id="orgdc1574b">枚举值</h3>
<div class="outline-text-3" id="text-orgdc1574b">
<p>
可以像这样 <b>创建</b> IpAddrKind 两个不同成员的 <b>实例</b> ： 
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">four</span> = <span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V4</span>;
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">six</span> = <span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V6</span>;
</pre>
</div>

<p>
注意：枚举的 <span class="underline">成员</span> 位于其 <span class="underline">标识符的命名空间</span> 中，并使用 <b>两个冒号</b> 分开
</p>

<pre class="example">
  这么设计的益处是现在 IpAddrKind::V4 和 IpAddrKind::V6 都是 IpAddrKind 类型的
</pre>

<p>
接着可以定义一个 <span class="underline">函数</span> 来 <b>获取任何 IpAddrKind</b> ：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">route</span>(<span style="color: #4eee94;">ip_type</span>: <span style="color: #98f5ff;">IpAddrKind</span>) { }
</pre>
</div>

<p>
现在可以使用任一成员来调用这个函数：
</p>

<div class="org-src-container">
<pre class="src src-rust">route(<span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V4</span>);
route(<span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V6</span>);
</pre>
</div>

<pre class="example">
  进一步考虑一下 IP 地址类型，目前没有一个存储实际 IP 地址 数据 的方法：只知道它是什么 类型 的
</pre>
<p>
考虑到已经学习过结构体了，可能会像下面那样处理这个问题：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">IpAddrKind</span> {
    <span style="color: #98f5ff;">V4</span>,
    <span style="color: #98f5ff;">V6</span>,
}

<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #4eee94;">kind</span>: <span style="color: #98f5ff;">IpAddrKind</span>,
    <span style="color: #4eee94;">address</span>: <span style="color: #98f5ff;">String</span>,
}

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">home</span> = <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #4eee94;">kind</span>: <span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V4</span>,
    <span style="color: #4eee94;">address</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"127.0.0.1"</span>),
};

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">loopback</span> = <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #4eee94;">kind</span>: <span style="color: #98f5ff;">IpAddrKind</span>::<span style="color: #98f5ff;">V6</span>,
    <span style="color: #4eee94;">address</span>: <span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"::1"</span>),
};
</pre>
</div>

<pre class="example">
这里定义了一个有两个字段的结构体 IpAddr：
1. IpAddrKind（之前定义的枚举）类型的 kind 字段
2. String 类型 address 字段

同时有这个结构体的两个实例：
1. home：它的 kind 的值是 IpAddrKind::V4 与之相关联的地址数据是 127.0.0.1
2. loopback：kind 的值是 IpAddrKind 的另一个成员，V6，关联的地址是 ::1

这里使用了一个结构体来将 kind 和 address 打包在一起，现在枚举成员就与值相关联了
</pre>

<p>
可以使用一种更简洁的方式来表达相同的概念，仅仅使用枚举并 <b>将 <span class="underline">数据</span> 直接放进每一个枚举成员</b> 而不是将枚举作为结构体的一部分。IpAddr 枚举的新定义表明了 V4 和 V6 成员都关联了 String 值：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #98f5ff;">V4</span>(<span style="color: #98f5ff;">String</span>),
    <span style="color: #98f5ff;">V6</span>(<span style="color: #98f5ff;">String</span>),
}

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">home</span> = <span style="color: #98f5ff;">IpAddr</span>::<span style="color: #98f5ff;">V4</span>(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"127.0.0.1"</span>));

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">loopback</span> = <span style="color: #98f5ff;">IpAddr</span>::<span style="color: #98f5ff;">V6</span>(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"::1"</span>));
</pre>
</div>

<pre class="example">
  直接将数据附加到枚举的每个成员上，这样就不需要一个额外的结构体了
</pre>

<p>
用枚举替代结构体还有另一个优势： <span class="underline">每个成员</span> 可以处理 <b>不同类型和数量</b> 的数据
</p>

<pre class="example">
IPv4 版本的 IP 地址总是含有四个值在 0 和 255 之间的数字部分

如果我们想要将 V4 地址存储为四个 u8 值而 V6 地址仍然表现为一个 String，这就不能使用结构体了
</pre>

<p>
枚举则可以轻易处理的这个情况：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #98f5ff;">V4</span>(<span style="color: #98f5ff;">u8</span>, <span style="color: #98f5ff;">u8</span>, <span style="color: #98f5ff;">u8</span>, <span style="color: #98f5ff;">u8</span>),
    <span style="color: #98f5ff;">V6</span>(<span style="color: #98f5ff;">String</span>),
}

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">home</span> = <span style="color: #98f5ff;">IpAddr</span>::<span style="color: #98f5ff;">V4</span>(127, 0, 0, 1);

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">loopback</span> = <span style="color: #98f5ff;">IpAddr</span>::<span style="color: #98f5ff;">V6</span>(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"::1"</span>));
</pre>
</div>

<pre class="example">
  这些代码展示了使用枚举来存储两种不同 IP 地址的几种可能的选择

  然而，标准库提供了一个开箱即用的定义
</pre>

<p>
标准库定义 IpAddr ：
</p>
<ul class="org-ul">
<li>它正有着跟我们定义和使用的一样的枚举和成员</li>
<li>不过它将 <span class="underline">成员中的地址数据</span> <b>嵌入</b> 到了两个 <span class="underline">不同形式的结构体</span> 中，它们对不同的成员的定义是不同的：</li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Ipv4Addr</span> {
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">--snip--</span>
}

<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">Ipv6Addr</span> {
    <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">--snip--</span>
}

<span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">IpAddr</span> {
    <span style="color: #98f5ff;">V4</span>(<span style="color: #98f5ff;">Ipv4Addr</span>),
    <span style="color: #98f5ff;">V6</span>(<span style="color: #98f5ff;">Ipv6Addr</span>),
}
</pre>
</div>

<pre class="example">
  这些代码展示了可以将任意类型的数据放入枚举成员中：例如字符串、数字类型或者结构体。甚至可以包含另一个枚举！

  另外，标准库中的类型通常并不比你设想出来的要复杂多少

  注意：虽然标准库中包含一个 IpAddr 的定义，仍然可以创建和使用自己的定义而不会有冲突
  这是因为并没有将标准库中的定义引入作用域
</pre>

<p>
来看看另一个枚举的例子：它的成员中内嵌了多种多样的类型：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">Message</span> {
    <span style="color: #98f5ff;">Quit</span>,
    <span style="color: #98f5ff;">Move</span> { <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">i32</span>, <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">i32</span> },
    <span style="color: #98f5ff;">Write</span>(<span style="color: #98f5ff;">String</span>),
    <span style="color: #98f5ff;">ChangeColor</span>(<span style="color: #98f5ff;">i32</span>, <span style="color: #98f5ff;">i32</span>, <span style="color: #98f5ff;">i32</span>),
}
</pre>
</div>

<p>
这个枚举有四个含有不同类型的成员：
</p>
<ul class="org-ul">
<li>Quit：没有关联任何数据</li>
<li>Move:  包含一个 <span class="underline">匿名结构体</span></li>
<li>Write:  包含 <span class="underline">单独一个 String</span></li>
<li>ChangeColor: 包含 <span class="underline">三个 i32</span></li>
</ul>

<pre class="example">
  定义一个这样的有关联值的枚举的方式和定义多个不同类型的结构体的方式很相像

  除了枚举不使用 struct 关键字以及其所有成员都被组合在一起位于 Message 类型中
</pre>

<p>
下面这些结构体可以包含与之前枚举成员中相同的数据：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">QuitMessage</span>; <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#31867;&#21333;&#20803;&#32467;&#26500;&#20307;</span>
<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">MoveMessage</span> {
    <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">i32</span>,
    <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">i32</span>,
}
<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">WriteMessage</span>(<span style="color: #98f5ff;">String</span>); <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20803;&#32452;&#32467;&#26500;&#20307;</span>
<span style="color: #00bfff; font-weight: bold;">struct</span> <span style="color: #98f5ff;">ChangeColorMessage</span>(<span style="color: #98f5ff;">i32</span>, <span style="color: #98f5ff;">i32</span>, <span style="color: #98f5ff;">i32</span>); <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#20803;&#32452;&#32467;&#26500;&#20307;</span>
</pre>
</div>

<pre class="example">
  不过，如果使用不同的结构体，则它们都有不同的类型，

  这样就不能轻易地定义一个能够“处理这些不同类型的结构体”的函数，反之枚举就可以
</pre>

<p>
结构体和枚举还有另一个相似点：可以使用 <span class="underline">impl</span> 来为结构体定义方法那样，也可以在 <b>枚举上定义方法</b> 。这是一个定义在 Message 枚举上的叫做 <span class="underline">call</span> 的方法：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">impl</span> <span style="color: #98f5ff;">Message</span> {
    <span style="color: #00bfff; font-weight: bold;">fn</span> <span style="color: #daa520; font-weight: bold;">call</span>(&amp;<span style="color: #00bfff; font-weight: bold;">self</span>) {
        <span style="color: #5f9ea0; font-style: italic;">// </span><span style="color: #5f9ea0; font-style: italic;">&#22312;&#36825;&#37324;&#23450;&#20041;&#26041;&#27861;&#20307;</span>
    }
}

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">m</span> = <span style="color: #98f5ff;">Message</span>::<span style="color: #98f5ff;">Write</span>(<span style="color: #98f5ff;">String</span>::from(<span style="color: #deb887;">"hello"</span>));
m.call();
</pre>
</div>

<p>
方法体使用了 <span class="underline">self</span> 来获取调用方法的值：
</p>
<ul class="org-ul">
<li>创建了一个值为  <span class="underline">Message::Write(String::from("hello"))</span> 的变量 <span class="underline">m</span></li>
<li><span class="underline">m</span> 就是当 m.call() 运行时 call 方法中的 <span class="underline">self</span> 的值</li>
</ul>

<pre class="example">
  现在来看看标准库中的另一个非常常见且实用的枚举：Option
</pre>
</div>
</div>
<div id="outline-container-orgccffc0a" class="outline-3">
<h3 id="orgccffc0a">Option 枚举</h3>
<div class="outline-text-3" id="text-orgccffc0a">
<pre class="example">
在之前的部分，看到了 IpAddr 枚举如何利用 Rust 的类型系统在程序中编码更多信息而不单单是数据

接下来分析一个 Option 的案例，Option 是标准库定义的另一个枚举
Option 类型应用广泛因为它编码了一个非常普遍的场景，即一个值要么有值要么没值

从类型系统的角度来表达这个概念就意味着编译器需要检查是否处理了所有应该处理的情况
这样就可以避免在其他编程语言中非常常见的 bug
</pre>

<pre class="example">
编程语言的设计经常要考虑包含哪些功能，但考虑排除哪些功能也很重要

Rust 并没有很多其他语言中有的空值(NULL)功能
</pre>
<p>
<span class="underline">空值</span> 是一个值，它 <b>代表没有值</b> 。在有空值的语言中，变量总是这两种状态之一： <span class="underline">空值</span> 和 <span class="underline">非空值</span> 
</p>

<pre class="example">
  空值的问题在于当你尝试像一个非空值那样使用一个空值，会出现某种形式的错误

  因为空和非空的属性无处不在，非常容易出现这类错误
</pre>

<p>
然而，空值尝试表达的概念仍然是有意义的：空值是一个 <b>因为某种原因目前无效或缺失的值</b> 
</p>

<pre class="example">
问题不在于概念而在于具体的实现
</pre>
<p>
Rust 并没有空值，不过它确实拥有一个可以编码 <b>存在或不存在概念的枚举</b> 。这个枚举是 <span class="underline">Option&lt;T&gt;</span> ，而且它定义于标准库中，如下:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">enum</span> <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">T</span>&gt; {
    <span style="color: #98f5ff;">Some</span>(<span style="color: #98f5ff;">T</span>),
    <span style="color: #98f5ff;">None</span>,
}
</pre>
</div>

<pre class="example">
Option&lt;T&gt; 枚举是如此有用以至于它甚至被包含在了 prelude 之中，不需要将其显式引入作用域

另外，它的成员也是如此，可以不需要 Option:: 前缀来直接使用 Some 和 None

即便如此 Option&lt;T&gt; 也仍是常规的枚举，Some(T) 和 None 仍是 Option&lt;T&gt; 的成员

&lt;T&gt; 语法一个泛型类型参数：意味着 Option 枚举的 Some 成员可以包含任意类型的数据
</pre>

<p>
这里是一些包含数字类型和字符串类型 Option 值的例子：
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">some_number</span> = <span style="color: #98f5ff;">Some</span>(5);
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">some_string</span> = <span style="color: #98f5ff;">Some</span>(<span style="color: #deb887;">"a string"</span>);

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">absent_number</span>: <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">i32</span>&gt; = <span style="color: #98f5ff;">None</span>;
</pre>
</div>

<p>
如果使用 <span class="underline">None</span> 而不是 Some，需要告诉 Rust Option&lt;T&gt; 是什么 <b>类型</b> 的，因为编译器只通过 None 值无法推断出 Some 成员保存的值的类型
</p>

<pre class="example">
  当有一个 Some 值时，就知道存在一个值，而这个值保存在 Some 中

  当有个 None 值时，在某种意义上，它跟空值具有相同的意义：并没有一个有效的值

  那么，Option&lt;T&gt; 为什么就比空值要好呢？
</pre>

<p>
简而言之，因为 <span class="underline">Option&lt;T&gt;</span> 和  <span class="underline">T</span> 是不同的类型，编译器 <b>不允许</b> 像一个 <span class="underline">肯定有效的值</span> 那样使用 <span class="underline">Option&lt;T&gt;</span> 。例如，这段代码不能编译，因为它尝试将 Option&lt;i8&gt; 与 i8 相加：
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">x</span>: <span style="color: #98f5ff;">i8</span> = 5;
<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">y</span>: <span style="color: #98f5ff;">Option</span>&lt;<span style="color: #98f5ff;">i8</span>&gt; = <span style="color: #98f5ff;">Some</span>(5);

<span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #4eee94;">sum</span> = x + y;
</pre>
</div>

<p>
如果运行这段代码，将会编译报错：
</p>

<div class="org-src-container">
<pre class="src src-sh">error[E0277]: the trait bound <span style="color: #fa8072;">`i8: std::ops::Add&lt;std::option::Option&lt;i8&gt;&gt;`</span> is
not satisfied
 --&gt;
  |
5 |     let sum = x + y;
  |                 ^ no implementation for <span style="color: #fa8072;">`i8 + std::option::Option&lt;i8&gt;`</span>
</pre>
</div>

<pre class="example">
  错误信息意味着 Rust 不知道该如何将 Option&lt;i8&gt; 与 i8 相加，因为它们的类型不同

  当在 Rust 中拥有一个像 i8 这样类型的值时，编译器确保它总是有一个有效的值。可以自信使用而无需做空值检查
  只有当使用 Option&lt;i8&gt;（或者任何用到的类型）的时候需要担心可能没有值，而编译器会确保在使用值之前处理了为空的情况。

  换句话说，在对 Option&lt;T&gt; 进行 T 的运算之前必须将其转换为 T
  通常这能帮助捕获到空值最常见的问题之一：假设某值不为空但实际上为空的情况

  不再担心会错误的假设一个非空值，会对代码更加有信心：
  为了拥有一个可能为空的值，必须要显式的将其放入对应类型的 Option&lt;T&gt; 中，当使用这个值时，必须明确的处理值为空的情况
  只要一个值不是 Option&lt;T&gt; 类型，就 可以 安全的认定它的值不为空

  这是 Rust 的一个经过深思熟虑的设计决策，来限制空值的泛滥以增加 Rust 代码的安全性
</pre>

<p>
那么当有一个 Option&lt;T&gt; 的值时，如何从 Some 成员中取出 T 的值来使用它呢？Option&lt;T&gt; 枚举拥有大量用于各种情况的方法：可以查看它的文档
</p>

<pre class="example">
总的来说，为了使用 Option&lt;T&gt; 值，需要编写处理每个成员的代码：
1. 想要一些代码只当拥有 Some(T) 值时运行，允许这些代码使用其中的 T
2. 也希望一些代码在值为 None 时运行，这些代码并没有一个可用的 T 值

match 表达式就是这么一个处理枚举的控制流结构：
它会根据枚举的成员运行不同的代码，这些代码可以使用匹配到的值中的数据
</pre>
</div>
</div>
</div>
<div id="outline-container-org270d641" class="outline-2">
<h2 id="org270d641">match 表达式</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
